; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v13 ?v11)
             (pred_2 ?v5 ?v1)
             (pred_8 ?v13 ?v1)
             (pred_5 ?v4 ?v13 )
	     (pred_10 ?v13)
             (pred_4 ?v12)
             (pred_12 ?v5)
             (pred_7 ?v1)
             (pred_1 ?v13)
             (pred_6 ?v5)
             (pred_3 ?v13)
             (pred_9 ))



(:action op_5
:parameters (?v3 ?v6 ?v7 ?v10)
:precondition (and (pred_4 ?v3) (pred_4 ?v6) (pred_12 ?v7) (pred_7 ?v10)
          (pred_11 ?v3 ?v6) (pred_2 ?v7 ?v10)
                   (pred_8 ?v6 ?v10) (pred_10 ?v3) 
                   (pred_1 ?v6) (pred_6 ?v7))
:effect (and  (pred_3 ?v6) (not (pred_1 ?v6))))


(:action op_4
:parameters (?v3 ?v8)
:precondition (and (pred_4 ?v3) (pred_4 ?v8)
               (pred_10 ?v3) (pred_11 ?v3 ?v8) (pred_3 ?v8))
:effect (and (pred_10 ?v8) (not (pred_10 ?v3))))

(:action op_1
:parameters (?v3 ?v7)
:precondition (and (pred_4 ?v3) (pred_12 ?v7) 
                  (pred_10 ?v3) (pred_5 ?v7 ?v3) (pred_9 ))
:effect (and (pred_6 ?v7)
   (not (pred_5 ?v7 ?v3)) (not (pred_9 ))))


(:action op_3
:parameters (?v3 ?v9 ?v2)
:precondition (and (pred_4 ?v3) (pred_12 ?v9) (pred_12 ?v2)
                  (pred_10 ?v3) (pred_6 ?v2) (pred_5 ?v9 ?v3))
:effect (and (pred_6 ?v9) (pred_5 ?v2 ?v3)
        (not (pred_6 ?v2)) (not (pred_5 ?v9 ?v3))))

(:action op_2
:parameters (?v3 ?v7)
:precondition (and (pred_4 ?v3) (pred_12 ?v7) 
                  (pred_10 ?v3) (pred_6 ?v7))
:effect (and (pred_9 ) (pred_5 ?v7 ?v3) (not (pred_6 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_08 obj_16 obj_14 obj_11 obj_20 obj_05 obj_02 obj_04 obj_15 obj_19 obj_13 obj_01 obj_09 obj_17 obj_18
    obj_06 obj_07
    obj_21 obj_12 obj_10
    )

    (:init
       (pred_9)

       (pred_4 obj_03)
       (pred_4 obj_08)
       (pred_4 obj_16)
       (pred_4 obj_14)
       (pred_4 obj_11)
       (pred_4 obj_20)
       (pred_4 obj_05)
       (pred_4 obj_02)
       (pred_4 obj_04)
       (pred_4 obj_15)
       (pred_4 obj_19)
       (pred_4 obj_13)
       (pred_4 obj_01)
       (pred_4 obj_09)
       (pred_4 obj_17)
       (pred_4 obj_18)
       (pred_7 obj_06)
       (pred_7 obj_07)
       (pred_12 obj_21)
       (pred_12 obj_12)
       (pred_12 obj_10)

       (pred_11 obj_03 obj_11)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_08 obj_20)
       (pred_11 obj_08 obj_16)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_16 obj_05)
       (pred_11 obj_16 obj_14)
       (pred_11 obj_16 obj_08)
       (pred_11 obj_14 obj_02)
       (pred_11 obj_14 obj_16)
       (pred_11 obj_11 obj_04)
       (pred_11 obj_11 obj_20)
       (pred_11 obj_11 obj_03)
       (pred_11 obj_20 obj_15)
       (pred_11 obj_20 obj_05)
       (pred_11 obj_20 obj_08)
       (pred_11 obj_20 obj_11)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_05 obj_02)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_02 obj_13)
       (pred_11 obj_02 obj_14)
       (pred_11 obj_02 obj_05)
       (pred_11 obj_04 obj_01)
       (pred_11 obj_04 obj_15)
       (pred_11 obj_04 obj_11)
       (pred_11 obj_15 obj_09)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_20)
       (pred_11 obj_15 obj_04)
       (pred_11 obj_19 obj_17)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_13 obj_02)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_01 obj_09)
       (pred_11 obj_01 obj_04)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_09 obj_15)
       (pred_11 obj_09 obj_01)
       (pred_11 obj_17 obj_18)
       (pred_11 obj_17 obj_19)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_18 obj_17)
       (pred_1 obj_20)
       (pred_1 obj_02)
       (pred_1 obj_17)
       (pred_8  obj_20 obj_06)
       (pred_8  obj_02 obj_07)
       (pred_8  obj_17 obj_06)
       (pred_3 obj_03)
       (pred_3 obj_08)
       (pred_3 obj_16)
       (pred_3 obj_14)
       (pred_3 obj_11)
       (pred_3 obj_05)
       (pred_3 obj_04)
       (pred_3 obj_15)
       (pred_3 obj_19)
       (pred_3 obj_13)
       (pred_3 obj_01)
       (pred_3 obj_09)
       (pred_3 obj_18)

       (pred_2  obj_21 obj_06)
       (pred_2  obj_12 obj_07)
       (pred_2  obj_10 obj_06)
       (pred_5 obj_21 obj_19)
       (pred_5 obj_12 obj_05)
       (pred_5 obj_10 obj_19)
       (pred_10 obj_11)
    )

    (:goal (and
       (pred_5 obj_21 obj_11)
       (pred_5 obj_12 obj_03)
       (pred_5 obj_10 obj_20)
    ))
(:constraints
  (always (not (pred_10 obj_15)))
)
)

; plan
1. (op_4 obj_11 obj_03)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_03)
   goals met: 0 of 3
2. (op_4 obj_03 obj_08)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_08)
   goals met: 0 of 3
3. (op_4 obj_08 obj_16)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_16)
   goals met: 0 of 3
4. (op_4 obj_16 obj_05)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_05)
   goals met: 0 of 3
5. (op_1 obj_05 obj_12)
   deleted: (pred_5 obj_12 obj_05) (pred_9)
   added: (pred_6 obj_12)
   goals met: 0 of 3
6. (op_4 obj_05 obj_16)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_16)
   goals met: 0 of 3
7. (op_4 obj_16 obj_08)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_08)
   goals met: 0 of 3
8. (op_4 obj_08 obj_03)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_03)
   goals met: 0 of 3
9. (op_2 obj_03 obj_12)
   deleted: (pred_6 obj_12)
   added: (pred_9) (pred_5 obj_12 obj_03)
   goals met: 1 of 3
10. (op_4 obj_03 obj_08)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_08)
   goals met: 1 of 3
11. (op_4 obj_08 obj_16)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_16)
   goals met: 1 of 3
12. (op_4 obj_16 obj_05)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_05)
   goals met: 1 of 3
13. (op_4 obj_05 obj_19)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_19)
   goals met: 1 of 3
14. (op_1 obj_19 obj_10)
   deleted: (pred_5 obj_10 obj_19) (pred_9)
   added: (pred_6 obj_10)
   goals met: 1 of 3
15. (op_4 obj_19 obj_05)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_05)
   goals met: 1 of 3
16. (op_5 obj_05 obj_20 obj_10 obj_06)
   deleted: (pred_1 obj_20)
   added: (pred_3 obj_20)
   goals met: 1 of 3
17. (op_4 obj_05 obj_20)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_20)
   goals met: 1 of 3
18. (op_2 obj_20 obj_10)
   deleted: (pred_6 obj_10)
   added: (pred_9) (pred_5 obj_10 obj_20)
   goals met: 2 of 3
19. (op_4 obj_20 obj_05)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_05)
   goals met: 2 of 3
20. (op_4 obj_05 obj_19)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_19)
   goals met: 2 of 3
21. (op_1 obj_19 obj_21)
   deleted: (pred_5 obj_21 obj_19) (pred_9)
   added: (pred_6 obj_21)
   goals met: 2 of 3
22. (op_4 obj_19 obj_05)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_05)
   goals met: 2 of 3
23. (op_4 obj_05 obj_20)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_20)
   goals met: 2 of 3
24. (op_4 obj_20 obj_11)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_11)
   goals met: 2 of 3
25. (op_2 obj_11 obj_21)
   deleted: (pred_6 obj_21)
   added: (pred_9) (pred_5 obj_21 obj_11)
   goals met: 3 of 3
